OpenTollGate/tollgate-esp32/sdkconfig.defaults.esp32c3
# ============================================================
# Balloon TollGate — ESP32-C3 sdkconfig defaults
# Target: ESP32-C3 (4MB flash, 400KB RAM, no PSRAM, single core)
# ============================================================

# --- Target chip ---
CONFIG_IDF_TARGET="esp32c3"

# --- WiFi ---
CONFIG_ESP_WIFI_ENABLED=y
CONFIG_ESP_WIFI_SOFTAP_SUPPORT=y

# --- Flash size (C3 has 4MB embedded) ---
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="4MB"

# --- NAPT (NAT for captive portal clients) ---
CONFIG_LWIP_IP_FORWARD=y
CONFIG_LWIP_IPV4_NAPT=y

# --- No PPP/GSM upstream (balloon uses radio, not GSM) ---
CONFIG_LWIP_PPP_SUPPORT=n

# --- Disable IPv6 for simplicity ---
CONFIG_LWIP_IPV6=n

# --- Task stack ---
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# --- FreeRTOS ---
CONFIG_FREERTOS_HZ=1000

# --- Logging ---
CONFIG_LOG_DEFAULT_LEVEL_INFO=y

# --- HTTP server ---
CONFIG_HTTPD_MAX_REQ_HDR_LEN=1024
CONFIG_HTTPD_MAX_URI_LEN=512
CONFIG_HTTPD_WS_SUPPORT=y

# --- lwIP sockets ---
CONFIG_LWIP_MAX_SOCKETS=16

# --- Partition table ---
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions_c3.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions_c3.csv"

# --- mbedTLS (HTTPS to Cashu mint) ---
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=y
CONFIG_MBEDTLS_DYNAMIC_BUFFER=y
CONFIG_MBEDTLS_SSL_IN_CONTENT_LEN=4096
CONFIG_MBEDTLS_SSL_OUT_CONTENT_LEN=4096
CONFIG_MBEDTLS_HARDWARE_MPI=n

# --- No PSRAM (C3 has none) ---
CONFIG_SPIRAM=n
